#include <iostream>
#include <algorithm>
												 

using namespace std;


int main(void) {



	

	// 胡牌分析

	  // 胡牌权重
	  
	  // 牌局前后期分析


	// 听牌分析
	  // 听牌打生牌 （送人吃碰，快速摸牌）


	// 牌型分析
	  // 必留牌型 刻子 杠牌 字对
	  // 成型牌 三搭子、对子、
	  // 缺牌牌型


	
	// 出牌分析

	  // 如遇抉择牌型
	  // 有熟张出熟张
	  // 走生张时应再判断
	      // 1. 生张  2. 


	  

	  // 确定与摸进的牌相关的关联牌

	  // 搭子分析
	    // 有边搭，拆边搭

		  // 四搭子分析 
	    
			// 前期出张，中后期出尾张

		  // 两连搭分析
	    
			

	  // 对子分析


	return 0;
}